downloadUtil/app/controllers/daily_downloads_controller.rb

INSERT INTO `daily_downloads` (`created_at`, `read_time`, `title`, `updated_at`, `user_id`) VALUES('2010-11-30 13:22:25', '2010-11-30 05:21:00', 'This is the shite! ', '2010-11-30 13:22:25', 1)
---
  def create
    time = Time.parse( params[:date][:hour] + ":" + params[:date][:minute] )
    time_utc = time.utc.hour.to_s  + ":" + time.utc.min.to_s
    @daily_download = DailyDownload.create(
        :read_time => Time.parse( time_utc ),
        :user => current_user,
        :title => params[:daily_download][:title]
    )